adamkondraciuk/nrfx/mdk/nrf54h20_enga_bbpr.svd
                <register>
                  <name>MBIASIBPSR</name>
                  <description>Trim value for SYSCTRL.MBIAS.MBIASIBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>OSCRFR</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_OSCRFR</headerStructName>
              <access>read-write</access>
              <addressOffset>0x70</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_OSCRFR_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>OSC</name>
                  <description>Trim value for SYSCTRL.OSCRFR.OSC</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>IBPSR</name>
                  <description>Trim value for SYSCTRL.OSCRFR.IBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREG1V0</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREG1V0</headerStructName>
              <access>read-write</access>
              <addressOffset>0x78</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREG1V0_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREG1V0.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HIGHPOWER</name>
                  <description>Trim value for SYSCTRL.VREG1V0.HIGHPOWER</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREG1V0.LOWPOWER</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ULPR</name>
                  <description>Trim value for SYSCTRL.VREG1V0.ULPR</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>VOUTHPNOMINAL</name>
                <description>Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL</description>
                <addressOffset>0x10</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>VREGAO0V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGAO0V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0x8C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGAO0V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HIGHPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.HIGHPOWER</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.LOWPOWER</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ULTRALOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.ULTRALOWPOWER</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BPDET</name>
                  <description>Trim value for SYSCTRL.VREGAO0V8.BPDET</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGAO1V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGAO1V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0xA0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGAO1V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VREF</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.VREF</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.LOWPOWER</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWERDIFF</name>
                  <description>Trim value for SYSCTRL.VREGAO1V8.LOWPOWERDIFF</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGMAIN</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGMAIN</headerStructName>
              <access>read-write</access>
              <addressOffset>0xB0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGMAIN_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>BIASIBPP</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.BIASIBPP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIASIBPSR</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.BIASIBPSR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDAO1V8HYSTOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.VDDAO1V8HYSTOUTPUT</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDAO1V8PWMOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.VDDAO1V8PWMOUTPUT</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDD1V0HYSTOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.VDD1V0HYSTOUTPUT</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDVS0V8HYSTOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.VDDVS0V8HYSTOUTPUT</description>
                  <addressOffset>0x14</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDDVS0V8PWMOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.VDDVS0V8PWMOUTPUT</description>
                  <addressOffset>0x18</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VDD1V0PWMOUTPUT</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.VDD1V0PWMOUTPUT</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ZCROSS</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.ZCROSS</description>
                  <addressOffset>0x20</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HSILIM</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.HSILIM</description>
                  <addressOffset>0x24</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ICMP</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.ICMP</description>
                  <addressOffset>0x28</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VGND</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.VGND</description>
                  <addressOffset>0x2C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGMRAM130</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGMRAM130</headerStructName>
              <access>read-write</access>
              <addressOffset>0xE0</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VBG</name>
                  <description>Trim value for SYSCTRL.VREGMRAM130.VBG</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIAS</name>
                  <description>Trim value for SYSCTRL.VREGMRAM130.BIAS</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VPR</name>
                  <description>Trim value for SYSCTRL.VREGMRAM130.VPR</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
