adamkondraciuk/nrfx/mdk/nrf54h20_enga_bbpr.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_STM_NS</name>
      <description>System Trace Macrocell</description>
      <baseAddress>0xBF042000</baseAddress>
      <headerStructName>STM</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>STM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>DMACTLR</name>
          <description>Controls the DMA transfer request mechanism.</description>
          <addressOffset>0xC10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SENS</name>
              <description>Determines the sensitivity of the DMA request to the current buffer level in the STM</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LT25</name>
                  <description>Buffer is &amp;lt;25 percent full.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LT50</name>
                  <description>Buffer is &amp;lt;50 percent full.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LT75</name>
                  <description>Buffer is &amp;lt;75 percent full.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LT100</name>
                  <description>Buffer is &amp;lt;100 percent full.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HEMASTR</name>
          <description>Indicates the STPv2 master number of hardware event trace. This number is the master number presented in STPv2.</description>
          <addressOffset>0xDF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASTER</name>
              <description>The STPv2 master number that hardware event traces should be associated with.</description>
              <lsb>0</lsb>
              <msb>16</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HEFEAT1R</name>
          <description>Indicates the features of the STM.</description>
          <addressOffset>0xDF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HETER</name>
              <description>STMHETER support</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HEERR</name>
              <description>Hardware event error detection support</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HEMASTR</name>
              <description>STMHEMASTR support</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMHE</name>
              <description>The number of hardware events supported by the STM</description>
              <lsb>15</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HEIDR</name>
          <description>Indicates the features of hardware event tracing in the STM.</description>
          <addressOffset>0xDFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLASS</name>
              <description>The CLASS field identifies the programmers model</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HardwareEventControl</name>
                  <description>Hardware Event Control programmers model</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLASSREV</name>
              <description>The CLASSREV field identifies the revision of the programmers model</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VENDSPEC</name>
              <description>The VENDSPEC field identifies any vendor specific modifications or mappings</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TCSR</name>
          <description>Controls the STM settings.</description>
          <addressOffset>0xE80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Global STM enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The STM is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The STM is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSEN</name>
              <description>Enable or disable timestamp bundling.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Time stamps are disabled. Requests for timestamp generation are ignored, and stimulus port writes selecting timestamping are treated as if it were not selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Time stamps are enabled. If stimulus writes select timestamping, a timestamp is output according to STPv2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>STMSYNCR is implemented so this value is Read As One.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The STM Sync feature is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The STM Sync feature is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPEN</name>
              <description>Compression Enable for Stimulus Ports.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Compression disabled, data transfers are transmitted at the size of the transaction.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Compression enabled, data transfers are compressed to save bandwidth.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACEID</name>
              <description>ATB Trace ID. Setting this value to all zeroes might result in Unpredictable tracing.</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>BUSY</name>
              <description>STM is busy, for example the STM trace FIFO is not empty.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>STM is not busy.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>STM is busy.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCR</name>
          <description>Used for implementation defined STM controls.</description>
          <addressOffset>0xE94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFOAF</name>
              <description>FIFO Auto-flush.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Auto-flush is disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Auto-flush is enabled. The STM automatically drains all data it has even if the ATB interface is not fully utilized.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASYNCPE</name>
              <description>Is ASYNC priority higher than trace?</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Lower</name>
                  <description>ASYNC priority is always lower than trace.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Escalate</name>
                  <description>ASYNC priority escalates on second synchronization request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIORINVDIS</name>
              <description>Controls arbitration between AXI and HW during flush.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Priority inversion, when AXI flush is finished, HW gets priority until HW flush is done.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Priority inversion disabled, AXI always has priority over HW.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKON</name>
              <description>Provides override control for architectural clock gate enable.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No override, clock gate is controlled by the state of STM.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Override, clock is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFREADYHIGH</name>
              <description>Provides override control for the AFREADY output</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No override, AFREADY is controlled by the state of STM.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Override, AFREADY is driven HIGH.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPFEAT1R</name>
          <description>Indicates the features of the STM.</description>
          <addressOffset>0xEA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROT</name>
              <description>Indicates the implemented STM protocol.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STPV2</name>
                  <description>STM implements the STPV2 protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TS</name>
              <description>Timestamp support.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absolute</name>
                  <description>Absolute timestamps implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSFREQ</name>
              <description>Timestamp frequency indication configuration.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>STMTSFREQR is read-only.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>STMTSFREQR is read-write.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCETS</name>
              <description>Timestamp force configuration.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>STMTSSTIMR bit 0 is read-only.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>STMTSSTIMR bit 0 is read-write.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACEBUS</name>
              <description>Trace bus support.</description>
              <lsb>10</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>TRIGCTL</name>
              <description>Trigger control support.</description>
              <lsb>14</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TSPRESCALE</name>
              <description>Timestamp prescale support</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>Timestamp prescale is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Timestamp prescale is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTEN</name>
              <description>STMTCSR.HWTEN support</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>STMTCSR.HWTEN is not implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>STMTCSR.SYNCEN support</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ReadAsOne</name>
                  <description>STMTCSR.SYNCEN implemented but always reads as b1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWOEN</name>
              <description>STMTCSR.SWOEN support</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>STMTCSR.SWOEN not implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
