adamkondraciuk/nrfx/mdk/nrf54h20_enga_bbpr.svd
        <register>
          <name>CTITRIGINSTATUS</name>
          <description>CTI Trigger In Status register Because the register provides a view of the raw ctitrigin inputs, the reset value is UNKNOWN.</description>
          <addressOffset>0x130</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINSTATUS_0</name>
              <description>Shows the status of ctitrigin0 input.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_1</name>
              <description>Shows the status of ctitrigin1 input.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_2</name>
              <description>Shows the status of ctitrigin2 input.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_3</name>
              <description>Shows the status of ctitrigin3 input.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_4</name>
              <description>Shows the status of ctitrigin4 input.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 4 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 4 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_5</name>
              <description>Shows the status of ctitrigin5 input.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 5 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 5 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_6</name>
              <description>Shows the status of ctitrigin6 input.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 6 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 6 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_7</name>
              <description>Shows the status of ctitrigin7 input.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 7 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 7 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTITRIGOUTSTATUS</name>
          <description>CTI Trigger Out Status register</description>
          <addressOffset>0x134</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTSTATUS_0</name>
              <description>Shows the status of ctitrigout0 output.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_1</name>
              <description>Shows the status of ctitrigout1 output.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_2</name>
              <description>Shows the status of ctitrigout2 output.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_3</name>
              <description>Shows the status of ctitrigout3 output.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_4</name>
              <description>Shows the status of ctitrigout4 output.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 4 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 4 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_5</name>
              <description>Shows the status of ctitrigout5 output.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 5 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 5 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_6</name>
              <description>Shows the status of ctitrigout6 output.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 6 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 6 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_7</name>
              <description>Shows the status of ctitrigout7 output.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 7 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 7 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTICHINSTATUS</name>
          <description>CTI Channel In Status register Because the register provides a view of the raw ctichin inputs, the reset value is UNKNOWN.</description>
          <addressOffset>0x138</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTICHINSTATUS_0</name>
              <description>Shows the status of the ctitrigin 0 input.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHINSTATUS_1</name>
              <description>Shows the status of the ctitrigin 1 input.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHINSTATUS_2</name>
              <description>Shows the status of the ctitrigin 2 input.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHINSTATUS_3</name>
              <description>Shows the status of the ctitrigin 3 input.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTICHOUTSTATUS</name>
          <description>CTI Channel Out Status register</description>
          <addressOffset>0x13C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTICHOUTSTATUS_0</name>
              <description>Shows the status of the ctichout 0 output.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichout 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichout 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHOUTSTATUS_1</name>
              <description>Shows the status of the ctichout 1 output.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichout 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichout 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHOUTSTATUS_2</name>
              <description>Shows the status of the ctichout 2 output.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichout 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichout 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHOUTSTATUS_3</name>
              <description>Shows the status of the ctichout 3 output.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichout 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichout 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIGATE</name>
          <description>Enable CTI Channel Gate register</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>CTIGATEEN_0</name>
              <description>Enable ctichout0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ctichout channel 0 propagation.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ctichout channel 0 propagation.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIGATEEN_1</name>
              <description>Enable ctichout1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ctichout channel 1 propagation.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ctichout channel 1 propagation.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIGATEEN_2</name>
              <description>Enable ctichout2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ctichout channel 2 propagation.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ctichout channel 2 propagation.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIGATEEN_3</name>
              <description>Enable ctichout3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ctichout channel 3 propagation.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ctichout channel 3 propagation.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASICCTL</name>
          <description>External Multiplexer Control register</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ASICCTL</name>
              <description>When external multiplexing is implemented for trigger signals, then the number of multiplexed signals on each
                    trigger must be shown in the Device ID Register. This is done using a Verilog define EXTMUXNUM.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCHINACK</name>
          <description>Integration Test Channel Input Acknowledge register</description>
          <addressOffset>0xEDC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCHINACK_0</name>
              <description>Sets the value of the ctichinack 0 output</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTCHINACK_1</name>
              <description>Sets the value of the ctichinack 1 output</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTCHINACK_2</name>
              <description>Sets the value of the ctichinack 2 output</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTCHINACK_3</name>
              <description>Sets the value of the ctichinack 3 output</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
