adamkondraciuk/nrfx/mdk/nrf54h20_enga_bbpr.svd
        <register>
          <name>ITTRIGINACK</name>
          <description>Integration Test Trigger Input Acknowledge register</description>
          <addressOffset>0xEE0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTTRIGINACK_0</name>
              <description>Sets the value of the ctitriginack 0 output</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTTRIGINACK_1</name>
              <description>Sets the value of the ctitriginack 1 output</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTTRIGINACK_2</name>
              <description>Sets the value of the ctitriginack 2 output</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTTRIGINACK_3</name>
              <description>Sets the value of the ctitriginack 3 output</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CTTRIGINACK_4</name>
              <description>Sets the value of the ctitriginack 4 output</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CTTRIGINACK_5</name>
              <description>Sets the value of the ctitriginack 5 output</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTTRIGINACK_6</name>
              <description>Sets the value of the ctitriginack 6 output</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CTTRIGINACK_7</name>
              <description>Sets the value of the ctitriginack 7 output</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCHOUT</name>
          <description>Integration Test Channel Output register</description>
          <addressOffset>0xEE4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCHOUT_0</name>
              <description>Sets the value of the ctichout 0 output</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTCHOUT_1</name>
              <description>Sets the value of the ctichout 1 output</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTCHOUT_2</name>
              <description>Sets the value of the ctichout 2 output</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTCHOUT_3</name>
              <description>Sets the value of the ctichout 3 output</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITTRIGOUT</name>
          <description>Integration Test Trigger Output register</description>
          <addressOffset>0xEE8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTTRIGOUT_0</name>
              <description>Sets the value of the ctitrigout 0 output</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTTRIGOUT_1</name>
              <description>Sets the value of the ctitrigout 1 output</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTTRIGOUT_2</name>
              <description>Sets the value of the ctitrigout 2 output</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTTRIGOUT_3</name>
              <description>Sets the value of the ctitrigout 3 output</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CTTRIGOUT_4</name>
              <description>Sets the value of the ctitrigout 4 output</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CTTRIGOUT_5</name>
              <description>Sets the value of the ctitrigout 5 output</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTTRIGOUT_6</name>
              <description>Sets the value of the ctitrigout 6 output</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CTTRIGOUT_7</name>
              <description>Sets the value of the ctitrigout 7 output</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCHOUTACK</name>
          <description>Integration Test Channel Output Acknowledge register</description>
          <addressOffset>0xEEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCHOUTACK_0</name>
              <description>Reads the value of the ctichoutack 0 input</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTCHOUTACK_1</name>
              <description>Reads the value of the ctichoutack 1 input</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTCHOUTACK_2</name>
              <description>Reads the value of the ctichoutack 2 input</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTCHOUTACK_3</name>
              <description>Reads the value of the ctichoutack 3 input</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITTRIGOUTACK</name>
          <description>Integration Test Trigger Output Acknowledge register</description>
          <addressOffset>0xEF0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTTRIGOUT_0</name>
              <description>Reads the value of the ctitrigoutack 0 input</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTTRIGOUT_1</name>
              <description>Reads the value of the ctitrigoutack 1 input</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTTRIGOUT_2</name>
              <description>Reads the value of the ctitrigoutack 2 input</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTTRIGOUT_3</name>
              <description>Reads the value of the ctitrigoutack 3 input</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CTTRIGOUT_4</name>
              <description>Reads the value of the ctitrigoutack 4 input</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CTTRIGOUT_5</name>
              <description>Reads the value of the ctitrigoutack 5 input</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTTRIGOUT_6</name>
              <description>Reads the value of the ctitrigoutack 6 input</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CTTRIGOUT_7</name>
              <description>Reads the value of the ctitrigoutack 7 input</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCHIN</name>
          <description>Integration Test Channel Input register</description>
          <addressOffset>0xEF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCHIN_0</name>
              <description>Reads the value of the ctichin 0 input</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTCHIN_1</name>
              <description>Reads the value of the ctichin 1 input</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTCHIN_2</name>
              <description>Reads the value of the ctichin 2 input</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTCHIN_3</name>
              <description>Reads the value of the ctichin 3 input</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITTRIGIN</name>
          <description>Integration Test Trigger input register</description>
          <addressOffset>0xEF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTTRIGIN_0</name>
              <description>Reads the value of the ctitrigin 0 input</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>CTTRIGIN_1</name>
              <description>Reads the value of the ctitrigin 1 input</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CTTRIGIN_2</name>
              <description>Reads the value of the ctitrigin 2 input</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CTTRIGIN_3</name>
              <description>Reads the value of the ctitrigin 3 input</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CTTRIGIN_4</name>
              <description>Reads the value of the ctitrigin 4 input</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CTTRIGIN_5</name>
              <description>Reads the value of the ctitrigin 5 input</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTTRIGIN_6</name>
              <description>Reads the value of the ctitrigin 6 input</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CTTRIGIN_7</name>
              <description>Reads the value of the ctitrigin 7 input</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>Integration Mode Control register</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IME</name>
              <description>Integration Mode Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable integration mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable integration mode</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>Claim Tag Set register</description>
          <addressOffset>0xFA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>SET_0</name>
              <description>Determines whether claim bit 0 is implemented</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim tag bit 0 is implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim bit 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_1</name>
              <description>Determines whether claim bit 1 is implemented</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim tag bit 1 is implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim bit 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_2</name>
              <description>Determines whether claim bit 2 is implemented</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim tag bit 2 is implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim bit 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_3</name>
              <description>Determines whether claim bit 3 is implemented</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>Claim tag bit 3 is implemented</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Claim</name>
                  <description>Set claim bit 3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Claim Tag Clear register</description>
          <addressOffset>0xFA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLR_0</name>
              <description>Determines whether claim bit 0 is implemented</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unclaimed</name>
                  <description>Claim tag bit 0 is not set</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Claimed</name>
                  <description>Claim tag bit 0 is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Unclaim</name>
                  <description>Clear bit 0 of the claim tag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_1</name>
              <description>Determines whether claim bit 1 is implemented</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unclaimed</name>
                  <description>Claim tag bit 1 is not set</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Claimed</name>
                  <description>Claim tag bit 1 is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Unclaim</name>
                  <description>Clear bit 1 of the claim tag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_2</name>
              <description>Determines whether claim bit 2 is implemented</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unclaimed</name>
                  <description>Claim tag bit 2 is not set</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Claimed</name>
                  <description>Claim tag bit 2 is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Unclaim</name>
                  <description>Clear bit 2 of the claim tag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_3</name>
              <description>Determines whether claim bit 3 is implemented</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unclaimed</name>
                  <description>Claim tag bit 3 is not set</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Claimed</name>
                  <description>Claim tag bit 3 is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Unclaim</name>
                  <description>Clear bit 3 of the claim tag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <description>Lock Address Register</description>
          <addressOffset>0xFB0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>Software lock key value</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear the software lock</description>
                  <value>0xC5ACCE55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
