adamkondraciuk/nrfx/mdk/nrf54h20_enga_bbpr.svd
            <register>
              <name>IMR</name>
              <description>This read/write register masks or enables all interrupts generated by the DWC_ssi.</description>
              <addressOffset>0x02C</addressOffset>
              <access>read-write</access>
              <resetValue>0x000000FF</resetValue>
              <fields>
                <field>
                  <name>TXEIM</name>
                  <description>Transmit FIFO Empty Interrupt Mask</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXOIM</name>
                  <description>Transmit FIFO Overflow Interrupt Mask</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXUIM</name>
                  <description>Receive FIFO Underflow Interrupt Mask</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXOIM</name>
                  <description>Receive FIFO Overflow Interrupt Mask</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXFIM</name>
                  <description>Receive FIFO Full Interrupt Mask</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>ssi_rxf_intr interrupt is masked</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>ssi_rxf_intr interrupt is not masked</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MSTIM</name>
                  <description>Multi-Master Contention Interrupt Mask.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XRXOIM</name>
                  <description>XIP Receive FIFO Overflow Interrupt Mask</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXUIM</name>
                  <description>Transmit FIFO Underflow Interrupt Mask</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>AXIEM</name>
                  <description>AXI Error Interrupt Mask</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD9IMR</name>
                  <description>Reserved bits - read as zero</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPITEM</name>
                  <description>SPI Transmit Error Interrupt Mask</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DONEM</name>
                  <description>SSI Done Interrupt Mask</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASKED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASKED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD1232IMR</name>
                  <description>Reserved bits - read as zero</description>
                  <lsb>12</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>ISR</name>
              <description>This register reports the status of the DWC_ssi interrupts after they have been masked.</description>
              <addressOffset>0x030</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>TXEIS</name>
                  <description>Transmit FIFO Empty Interrupt Status</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXOIS</name>
                  <description>Transmit FIFO Overflow Interrupt Status</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXUIS</name>
                  <description>Receive FIFO Underflow Interrupt Status</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXOIS</name>
                  <description>Receive FIFO Overflow Interrupt Status</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXFIS</name>
                  <description>Receive FIFO Full Interrupt Status</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MSTIS</name>
                  <description>Multi-Master Contention Interrupt Status.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XRXOIS</name>
                  <description>XIP Receive FIFO Overflow Interrupt Status</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXUIS</name>
                  <description>Transmit FIFO Underflow Interrupt Status</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>AXIES</name>
                  <description>AXI Error Interrupt Status</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD9RISR</name>
                  <description>Reserved bits - read as zero</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPITES</name>
                  <description>SPI Transmit Error Interrupt</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DONES</name>
                  <description>SSI Done Interrupt Status</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVD1232RISR</name>
                  <description>Reserved bits - read as zero</description>
                  <lsb>12</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
