adamkondraciuk/nrfx/mdk/nrf54h20_enga_bbpr.svd
        <register>
          <name>LOOP</name>
          <description>Number of playbacks of a loop</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Number of playbacks of pattern cycles</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Looping disabled (stop at the end of the sequence)</description>
                  <value>0x0000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>SEQ[%s]</name>
          <description>Unspecified</description>
          <headerStructName>PWM_SEQ</headerStructName>
          <access>read-write</access>
          <addressOffset>0x520</addressOffset>
          <register>
            <name>PTR</name>
            <description>Description cluster: Beginning address in RAM of this sequence</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Beginning address in RAM of this sequence</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>Description cluster: Number of values (duty cycles) in this sequence</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CNT</name>
                <description>Number of values (duty cycles) in this sequence</description>
                <lsb>0</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Sequence is disabled, and shall not be started as it is empty</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>REFRESH</name>
            <description>Description cluster: Number of additional PWM periods between samples loaded into compare register</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>CNT</name>
                <description>Number of additional PWM periods between samples loaded into compare register (load every REFRESH.CNT+1 PWM periods)</description>
                <lsb>0</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Continuous</name>
                    <description>Update every PWM period</description>
                    <value>0x000000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENDDELAY</name>
            <description>Description cluster: Time added after the sequence</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CNT</name>
                <description>Time added after the sequence in PWM periods</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TERMINATEONBUSERROR</name>
            <description>Description cluster: Terminate the transaction if a BUSERROR event is detected.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUSERRORADDRESS</name>
            <description>Description cluster: Address of transaction that generated the last BUSERROR event.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ADDRESS</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>PWM_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x560</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>OUT[%s]</name>
            <description>Description collection: Output pin select for PWM channel n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>PWM_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x570</addressOffset>
          <cluster>
            <name>SEQA</name>
            <description>Unspecified</description>
            <headerStructName>PWM_DMA_SEQA</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>ENABLE</name>
              <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SEQB</name>
            <description>Unspecified</description>
            <headerStructName>PWM_DMA_SEQB</headerStructName>
            <access>read-write</access>
            <addressOffset>0x10</addressOffset>
            <register>
              <name>ENABLE</name>
              <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
              <addressOffset>0x00</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
