adamkondraciuk/nrfx/mdk/nrf54h20_enga_bbpr.svd
        <register>
          <name>STALLSTAT</name>
          <description>Stall status for EasyDMA RAM accesses. The fields in this register are set to STALL by hardware whenever a stall occurres and can be cleared (set to NOSTALL) by the CPU.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TX</name>
              <description>Stall status for EasyDMA RAM reads</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSTALL</name>
                  <description>No stall</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <description>A stall has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>Stall status for EasyDMA RAM writes</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSTALL</name>
                  <description>No stall</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <description>A stall has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable SPIM</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable SPIM</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable SPIM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SPIM</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>SPIM_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x508</addressOffset>
          <register>
            <name>SCK</name>
            <description>Pin select for SCK</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MOSI</name>
            <description>Pin select for MOSI signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MISO</name>
            <description>Pin select for MISO signal</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CSN</name>
            <description>Pin select for CSN</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>RXDDATA</name>
          <description>RXD register</description>
          <addressOffset>0x518</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXD</name>
              <description>RX data received. Double buffered.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDDATA</name>
          <description>TXD register</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXD</name>
              <description>TX data to send. Double buffered.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY</name>
          <description>SPI frequency. Accuracy depends on the HFCLK source selected.</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>SPI master data rate</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K125</name>
                  <description>125 kbps</description>
                  <value>0x02000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K250</name>
                  <description>250 kbps</description>
                  <value>0x04000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K500</name>
                  <description>500 kbps</description>
                  <value>0x08000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1</name>
                  <description>1 Mbps</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2</name>
                  <description>2 Mbps</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4</name>
                  <description>4 Mbps</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M8</name>
                  <description>8 Mbps</description>
                  <value>0x80000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M16</name>
                  <description>16 Mbps</description>
                  <value>0x0A000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M32</name>
                  <description>32 Mbps</description>
                  <value>0x14000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RXD</name>
          <description>RXD EasyDMA channel</description>
          <headerStructName>SPIM_RXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x534</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes in receive buffer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes in receive buffer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LIST</name>
            <description>EasyDMA list type</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LIST</name>
                <description>List type</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable EasyDMA list</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ArrayList</name>
                    <description>Use array list</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXD</name>
          <description>TXD EasyDMA channel</description>
          <headerStructName>SPIM_TXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x544</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Number of bytes in transmit buffer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes in transmit buffer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LIST</name>
            <description>EasyDMA list type</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LIST</name>
                <description>List type</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable EasyDMA list</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ArrayList</name>
                    <description>Use array list</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ORDER</name>
              <description>Bit order</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MsbFirst</name>
                  <description>Most significant bit shifted out first</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LsbFirst</name>
                  <description>Least significant bit shifted out first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Serial clock (SCK) phase</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Leading</name>
                  <description>Sample on leading edge of clock, shift serial data on trailing edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trailing</name>
                  <description>Sample on trailing edge of clock, shift serial data on leading edge</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Serial clock (SCK) polarity</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Active high</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>IFTIMING</name>
          <description>Unspecified</description>
          <headerStructName>SPIM_IFTIMING</headerStructName>
          <access>read-write</access>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>RXDELAY</name>
            <description>Sample delay for input serial data on MISO</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000002</resetValue>
            <fields>
              <field>
                <name>RXDELAY</name>
                <description>Sample delay for input serial data on MISO. The value specifies the number of 64 MHz clock cycles (15.625 ns) delay from the the sampling edge of SCK (leading edge for CONFIG.CPHA = 0, trailing edge for CONFIG.CPHA = 1) until the input serial data is sampled. As en example, if RXDELAY = 0 and CONFIG.CPHA = 0, the input serial data is sampled on the rising edge of SCK.</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CSNDUR</name>
            <description>Minimum duration between edge of CSN and edge of SCK. When SHORTS.END_START is used, this is also the minimum duration CSN must stay high between transactions.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000002</resetValue>
            <fields>
              <field>
                <name>CSNDUR</name>
                <description>Minimum duration between edge of CSN and edge of SCK. When SHORTS.END_START is used, this is the minimum duration CSN must stay high between transactions. The value is specified in number of 64 MHz clock cycles (15.625 ns).</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CSNPOL</name>
          <description>Polarity of CSN output</description>
          <addressOffset>0x568</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSNPOL</name>
              <description>Polarity of CSN output</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Active low (idle state high)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Active high (idle state low)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
